"""1 номер. 1 способ"""
res = ((16**350)*((15*3 - 29)**(4**(2+5))) + 1007)//63
s = ''
while res != 0:
    s += str(res%4)
    res //= 4
print(s.count('1'))

"""1 номер. 2 способ"""
res = ((16**350)*((15*3 - 29)**(4**(2+5))) + 1007)//63
c = 0
while res != 0:
    # Просто проверяем остаток и все.
    if res%4 == 1:
        c += 1
    res //= 4
print(c)

"""2 номер"""
m = []
for x in range(1, 7291):
    res = 27**298 + 27**269 - x
    c = 0
    while res != 0:
        if res%27 == 0:
            c += 1
        res //= 27
    m.append(c)
print(max(m))

"""3 номер"""
# Смотрим какие цифры есть в выражении. Если макс цифра 8, то мин СС = 9.
# Перебор обычно до 36-рично СС. Почему 36? 10 цифр + 26 латинских букв.
for p in range(7, 36):
    res = int('2465123', p) + int('251341', p)
    if res % 17 == 0:
        print(p, res//17)
        # Т.к. мы перебираем p от наим. к наиб., то логично, что первое нашедшее p
        # и есть ответ на задачу.
        break
